-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- 생성 시간: 22-05-17 09:52
-- 서버 버전: 10.4.21-MariaDB
-- PHP 버전: 8.0.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 데이터베이스: `priconne`
--

-- --------------------------------------------------------

--
-- 테이블 구조 `princess`
--

CREATE TABLE `princess` (
  `name` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `score` int(11) NOT NULL,
  `s10` int(11) DEFAULT 0,
  `s8` int(11) DEFAULT 0,
  `s7` int(11) DEFAULT 0,
  `ms1` int(11) DEFAULT 0,
  `ms2` int(11) DEFAULT 0,
  `ms3` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 테이블의 덤프 데이터 `princess`
--

INSERT INTO `princess` (`name`, `score`, `s10`, `s8`, `s7`, `ms1`, `ms2`, `ms3`) VALUES
('람', -1, 0, 0, 0, 1, 0, 0),
('레이', -1, 0, 0, 0, 1, 0, 0),
('루', -1, 0, 0, 0, 1, 0, 0),
('리마', -2, 0, 0, 0, 0, 1, 0),
('미사키', -2, 0, 0, 0, 0, 1, 0),
('미소기', -3, 0, 0, 0, 0, 0, 1),
('미오', 0, 0, 0, 0, 0, 0, 0),
('스즈메', 0, 0, 0, 0, 0, 0, 0),
('아오이', 0, 0, 0, 0, 0, 0, 0),
('아유미', 0, 0, 0, 0, 0, 0, 0),
('요리', 0, 0, 0, 0, 0, 0, 0),
('유이', 0, 0, 0, 0, 0, 0, 0),
('유카리', 0, 0, 0, 0, 0, 0, 0),
('카린', 0, 0, 0, 0, 0, 0, 0),
('캬루', 0, 0, 0, 0, 0, 0, 0),
('콧코로', 7, 0, 0, 1, 0, 0, 0),
('쿠루미', 7, 0, 0, 1, 0, 0, 0),
('페코린느', 7, 0, 0, 1, 0, 0, 0),
('히요리', 7, 0, 0, 1, 0, 0, 0),
('나나카', 7, 0, 0, 1, 0, 0, 0),
('린', 7, 0, 0, 1, 0, 0, 0),
('마츠리', 10, 1, 0, 0, 0, 0, 0),
('마히루', 0, 0, 0, 0, 0, 0, 0),
('미미', 0, 0, 0, 0, 0, 0, 0),
('미사토', 0, 0, 0, 0, 0, 0, 0),
('미야코', 0, 0, 0, 0, 0, 0, 0),
('미츠키', 0, 0, 0, 0, 0, 0, 0),
('미후유', 0, 0, 0, 0, 0, 0, 0),
('스즈나', 0, 0, 0, 0, 0, 0, 0),
('시노부', 0, 0, 0, 0, 0, 0, 0),
('시오리', 0, 0, 0, 0, 0, 0, 0),
('아야네', 0, 0, 0, 0, 0, 0, 0),
('아카리', 0, 0, 0, 0, 0, 0, 0),
('에리코', 10, 1, 0, 0, 0, 0, 0),
('유키', 0, 0, 0, 0, 0, 0, 0),
('츠무기', 0, 0, 0, 0, 0, 0, 0),
('치카', 0, 0, 0, 0, 0, 0, 0),
('카오리', 0, 0, 0, 0, 0, 0, 0),
('쿠우카', 16, 0, 2, 0, 0, 0, 0),
('타마키', 16, 0, 2, 0, 0, 0, 0),
('글레어', 0, 0, 0, 0, 0, 0, 0),
('네네카', 0, 0, 0, 0, 0, 0, 0),
('노조미', 7, 0, 0, 1, 0, 0, 0),
('니논', 7, 0, 0, 1, 0, 0, 0),
('라비리스타', 14, 0, 0, 2, 0, 0, 0),
('란파', 0, 0, 0, 0, 0, 0, 0),
('렘', 7, 0, 0, 1, 0, 0, 0),
('루나', 17, 1, 0, 1, 0, 0, 0),
('루카', 0, 0, 0, 0, 0, 0, 0),
('리노', 0, 0, 0, 0, 0, 0, 0),
('린(데레)', 16, 0, 2, 0, 0, 0, 0),
('마코토', 16, 0, 2, 0, 0, 0, 0),
('마호', 20, 2, 0, 0, 0, 0, 0),
('모니카', 8, 0, 1, 0, 0, 0, 0),
('무이미', 8, 0, 1, 0, 0, 0, 0),
('사렌', 0, 0, 0, 0, 0, 0, 0),
('셰피', 10, 1, 0, 0, 0, 0, 0),
('시즈루', 0, 0, 0, 0, 0, 0, 0),
('아리사', 8, 0, 1, 0, 0, 0, 0),
('아키노', 8, 0, 1, 0, 0, 0, 0),
('안나', 0, 0, 0, 0, 0, 0, 0),
('앤', 7, 0, 0, 1, 0, 0, 0),
('에밀리아', 7, 0, 0, 1, 0, 0, 0),
('우즈키', 17, 1, 0, 1, 0, 0, 0),
('유니', 7, 0, 0, 1, 0, 0, 0),
('이노리', 7, 0, 0, 1, 0, 0, 0),
('이리야', 7, 0, 0, 1, 0, 0, 0),
('이오', 10, 1, 0, 0, 0, 0, 0),
('쥰', 0, 0, 0, 0, 0, 0, 0),
('지타', 0, 0, 0, 0, 0, 0, 0),
('치에루', 30, 3, 0, 0, 0, 0, 0),
('카스미', 8, 0, 1, 0, 0, 0, 0),
('카야', 24, 0, 3, 0, 0, 0, 0),
('쿄우카', 37, 0, 2, 3, 0, 0, 0),
('크리스티나', 42, 0, 0, 6, 0, 0, 0),
('크레짓타', 42, 0, 0, 6, 0, 0, 0),
('클로에', 39, 1, 1, 3, 0, 0, 0),
('토모', 26, 1, 2, 0, 0, 0, 0),
('하츠네', 24, 0, 3, 0, 0, 0, 0),
('호마레', 10, 1, 0, 0, 0, 0, 0);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
